org/topics/revealjs.org
:PROPERTIES:
:ID:       b800ace2-a93e-45ec-b272-bfabc701b1da
:END:
#+title: revealjs

- 👉 [[https://slides.dornea.nu/2022/presentation-as-code/#/sec-title-slide][Presentation as Code (using revealJS)]]

* Additional resources
- 2024-04-18 ◦ [[https://gitlab.com/oer/org-re-reveal/-/issues/22][External Plugins (#22) · Issues · oer / org-re-reveal · GitLab]]
  - how to use external plugins
- 2024-04-18 ◦ [[https://brettsnaidero.github.io/svg-animation-slides/#/][SVG Animation Slides]] 
- 2024-01-11 ◦ [[https://zenika.github.io/adoc-presentation-model/reveal/reveal-my-asciidoc.html][Reveal my Asciidoc : a deep dive into presentation-as-code]]
  - This is how I got into revealJS
  - The [[https://github.com/Zenika/adoc-presentation-model][github repository]] (not maintained anymore)
- 2024-01-11 ◦ [[https://oer.gitlab.io/emacs-reveal-howto/howto.html][How to create presentations with emacs-reveal]]
  - Creator of ~org-re-reveal~ for Emacs (here is the [[https://oer.gitlab.io/org-re-reveal/Readme.html][introduction]])
- 2024-01-11 ◦ [[https://benjamin-hackl.at/talks/][Benjamin Hackl | Talks]]
  - good looking presentations
- 2024-01-11 ◦ [[https://chris-besch.com/articles/revealjs/][reveal.js your Presentation—Christopher Besch]]
  - nice, clean [[https://github.com/christopher-besch/presentations/blob/main/template/index.html][template]]
  - mentiones [[https://github.com/dafrenchyman/reveal.js-extrernal-code][GitHub - dafrenchyman/reveal.js-extrernal-code]]
** Plugins
- 2024-01-11 ◦ [[https://github.com/Martinomagnifico/reveal.js-appearance][GitHub - Martinomagnifico/reveal.js-appearance]]
- 2024-01-11 ◦ [[https://github.com/Martinomagnifico/reveal.js-simplemenu?][GitHub - Martinomagnifico/reveal.js-simplemenu]]
