content/topics/revealjs.md
+++
title = "revealjs"
author = ["Victor Dorneanu"]
draft = false
+++

-   👉 [Presentation as Code (using revealJS)](https://slides.dornea.nu/2022/presentation-as-code/#/sec-title-slide)


## Additional resources {#additional-resources}

-   2024-04-18 ◦ [External Plugins (#22) · Issues · oer / org-re-reveal · GitLab](https://gitlab.com/oer/org-re-reveal/-/issues/22)
    -   how to use external plugins
-   2024-04-18 ◦ [SVG Animation Slides](https://brettsnaidero.github.io/svg-animation-slides/#/)
-   2024-01-11 ◦ [Reveal my Asciidoc : a deep dive into presentation-as-code](https://zenika.github.io/adoc-presentation-model/reveal/reveal-my-asciidoc.html)
    -   This is how I got into revealJS
    -   The [github repository](https://github.com/Zenika/adoc-presentation-model) (not maintained anymore)
-   2024-01-11 ◦ [How to create presentations with emacs-reveal](https://oer.gitlab.io/emacs-reveal-howto/howto.html)
    -   Creator of `org-re-reveal` for Emacs (here is the [introduction](https://oer.gitlab.io/org-re-reveal/Readme.html))
-   2024-01-11 ◦ [Benjamin Hackl | Talks](https://benjamin-hackl.at/talks/)
    -   good looking presentations
-   2024-01-11 ◦ [reveal.js your Presentation—Christopher Besch](https://chris-besch.com/articles/revealjs/)
    -   nice, clean [template](https://github.com/christopher-besch/presentations/blob/main/template/index.html)
    -   mentiones [GitHub - dafrenchyman/reveal.js-extrernal-code](https://github.com/dafrenchyman/reveal.js-extrernal-code)


### Plugins {#plugins}

-   2024-01-11 ◦ [GitHub - Martinomagnifico/reveal.js-appearance](https://github.com/Martinomagnifico/reveal.js-appearance)
-   2024-01-11 ◦ [GitHub - Martinomagnifico/reveal.js-simplemenu](https://github.com/Martinomagnifico/reveal.js-simplemenu?)
